docs/CS/MachineLearning/NaturalLanguageProcessing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-18 Fri 10:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. Overview</a>
<ul>
<li><a href="#orgheadline1">1.1. Sentiment Lexicon and Its Issues</a></li>
</ul>
</li>
<li><a href="#orgheadline5">2. Definition of Sentiment Analysis</a>
<ul>
<li><a href="#orgheadline3">2.1. Structure</a></li>
<li><a href="#orgheadline4">2.2. Opinion Defintion</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Document level:</li>
</ul>
<p>
The task at this level is to classify whether a whole opinion document expresses a positive or negative sentiment.
</p>
<ul class="org-ul">
<li>Sentence level:</li>
</ul>
<p>
The task at this level goes to the sentences and determines whether each sentence expressed a positive, negative, or neutral opinion.
</p>

<p>
This level of analysis is closely related to subjectivity classification (Wiebe, Bruce and O'Hara, 1999), which distinguishes sentences (called objective sentences) that express factual information from sentences (called subjective sentences) that express subjective views and opinions.
</p>

<ul class="org-ul">
<li>Entity and Aspect level:</li>
</ul>
<p>
It is based on the idea that an opinion consists of a sentiment (positive or negative) and a target (of opinion).
</p>

<ul class="org-ul">
<li>regular opinions and comparative opinions</li>
</ul>
<p>
A regular opinion expresses a sentiment only on an particular entity or an aspect of the entity, e.g., “Coke tastes very good,” which expresses a positive sentiment on the aspect taste of Coke. A comparative opinion compares multiple entities based on some of their shared aspects, e.g., “Coke tastes better than Pepsi,” which compares Coke and Pepsi based on their tastes (an aspect) and expresses a preference for Coke.
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Sentiment Lexicon and Its Issues</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>lexicon</li>
</ul>
<p>
opinions, positive and negative.
</p>
<ul class="org-ul">
<li>issue</li>
</ul>
<p>
spam review
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">2</span> Definition of Sentiment Analysis</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.1</span> Structure</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Due to a large collection of opinions on the Web, some form of summary of opinions is needed (Hu and Liu, 2004).
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.2</span> Opinion Defintion</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Observation: An opinion consists of two key components: a target g and a sentiment s on the target.</li>

<li>Definition (Opinion): An opinion is a quadruple, (g, s, h, t), where g is the opinion (or sentiment) target, s is the sentiment about the target, h is the opinion holder and t is the time when the opinion was expressed.</li>

<li>Definition (entity): An entity e is a product, service, topic, issue, person, organization, or event. It is described with a pair, e: (T, W), where T is a hierarchy of parts, sub-parts, and so on, and W is a set of attributes of e.</li>

<li>Definition (opinion): An opinion is a quintuple, (ei, aij, sijkl, hk, tl), where ei is the name of an entity, aij is an aspect of ei, sijkl is the sentiment on aspect aij of entity ei, hk is the opinion holder, and tl is the time when the opinion is expressed by hk. The sentiment sijkl is positive, negative, or neutral, or expressed with different strength/intensity levels, e.g., 1 to 5 stars as used by most review sits on the Web.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-07-25 Tue&gt;</span></span></p>
<p class="author">Author: weiwu</p>
<p class="date">Created: 2017-08-18 Fri 10:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
